tutorials/combustion/XiFoam/ras/moriyoshiHomogeneous/0/ft
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ft;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.06;

boundaryField
{
    left            
    {
        type            symmetryPlane;
    }

    right           
    {
        type            symmetryPlane;
    }

    top             
    {
        type            symmetryPlane;
    }

    bottom          
    {
        type            symmetryPlane;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
